
# Project : Sales Data Wrangling 

## Table of Contents
<ul>
<li><a href="#intro">Introduction</a></li>
<li><a href="#Gathering">Data Gathering</a></li>
<li><a href="#Assessing">Data Assessing</a></li>
<li><a href="#Cleaning">Data Cleaning</a></li>    
<li><a href="#eda">Exploratory Data Analysis</a></li>
<li><a href="#Storing"> Data Storing</a></li>    
<li><a href="#conclusions">Conclusions</a></li>
</ul>

<a id='intro'></a>
## Introduction

### Dataset Description 

This dataset includes detailed sales information from multiple branches, with 16 columns and 1006 rows. The data contains details about invoices such as invoice number, branch where the sale occurred, customer type, product type, quantity sold, price per unit, taxes, total, payment method, and customer ratings. The goal of this data is to analyze sales, understand customer behavior, evaluate the financial performance of different branches, and explore factors affecting customer satisfaction.

In [1]:
# import  the libraries that you will use
import pandas as pd 
import numpy as np
import matplotlib.pyplot as plt 
%matplotlib inline
from datetime import time
# show all columns
pd.set_option('display.max_columns', None)

<a id='Gathering'></a>

## 1- Data Gathering

In [2]:
df = pd.read_csv("Capstone Data - Supermarket Sales.csv")
df.head(5)

,Invoice ID,Branch,Yangon,Naypyitaw,Mandalay,Customer type,Gender,Product line,Unit price,Quantity,Tax 5%,Total,Date,Time,Payment,Rating
0,750-67-8428,A,1,0,0,Normal,Male,Health and beauty,74.69,7,26.1415,NaN,1/5/2019,13:08,Ewallet,9.1
1,226-31-3081,C,0,1,0,Normal,Male,Electronic accessories,15.28,5,3.8200,80.2200,3/8/2019,10:29,Cash,9.6
2,631-41-3108,A,1,0,0,Normal,Male,Home and lifestyle,46.33,7,16.2155,340.5255,3/3/2019,13:23,Credit card,7.4
3,123-19-1176,A,1,0,0,Normal,Male,Health and beauty,58.22,8,NaN,489.0480,1/27/2019,8 - 30 PM,Ewallet,8.4
4,373-73-7910,A,1,0,0,Normal,Male,Sports and travel,86.31,7,30.2085,634.3785,2/8/2019,10:37,Ewallet,5.3

<a id='Assessing'></a>
## 2- Data Assessing

### 2-1- Tidiness issues

In [3]:
df.sample(5)

,Invoice ID,Branch,Yangon,Naypyitaw,Mandalay,Customer type,Gender,Product line,Unit price,Quantity,Tax 5%,Total,Date,Time,Payment,Rating
100,163-56-7055,C,0,1,0,Member,Male,Fashion accessories,48.71,1,2.4355,51.1455,3/26/2019,19:20,Cash,4.1
99,733-01-9107,B,0,0,1,Normal,Male,Home and lifestyle,82.7,6,24.8100,521.0100,3/5/2019,18:14,Cash,7.4
215,802-43-8934,A,1,0,0,Normal,Male,Home and lifestyle,18.28,1,0.9140,19.1940,3/22/2019,15:05,Credit card,8.3
353,565-67-6697,B,0,0,1,Member,Male,Home and lifestyle,27,9,12.1500,255.1500,3/2/2019,14:16,Cash,4.8
809,189-55-2313,C,0,1,0,Normal,Female,Fashion accessories,62.18,10,31.0900,652.8900,1/31/2019,10:33,Ewallet,6.0

In [4]:
df.shape

(1006, 16)

#### Each variable forms a column and contains values
- 'Yangon', 'Naypyitaw', 'Mandalay' convertir les colonnes

#### Each observation forms a row
- nothing

#### Each type of observational unit forms a table
- nothing

### 2-2- Quality issues

In [5]:
df.sample(10)

,Invoice ID,Branch,Yangon,Naypyitaw,Mandalay,Customer type,Gender,Product line,Unit price,Quantity,Tax 5%,Total,Date,Time,Payment,Rating
691,266-20-6657,C,0,1,0,Member,Male,Food and beverages,55.04,7,19.2640,404.5440,3/12/2019,19:39,Ewallet,5.2
96,766-85-7061,B,0,0,1,Normal,Male,Health and beauty,87.87,10,43.9350,922.6350,3/29/2019,10:25,Ewallet,5.1
356,632-90-0281,C,0,1,0,Normal,Female,Fashion accessories,37.55,10,18.7750,394.2750,3/8/2019,20:01,Credit card,9.3
508,291-21-5991,B,0,0,1,Member,Male,Health and beauty,61.29,5,15.3225,321.7725,3/29/2019,14:28,Cash,7.0
429,325-77-6186,A,1,0,0,Member,Female,Home and lifestyle,90.65,10,45.3250,951.8250,3/8/2019,10:53,Ewallet,7.3
200,606-80-4905,C,0,1,0,Member,Female,Sports and travel,19.15,6,5.7450,120.6450,1/29/2019,10:01,Credit card,6.8
375,667-23-5919,A,1,0,0,Member,Female,Fashion accessories,96.7,5,24.1750,507.6750,1/14/2019,12:52,Ewallet,7.0
730,247-11-2470,A,1,0,0,Member,Female,Fashion accessories,22.32,4,4.4640,93.7440,3/1/2019,16:23,Credit card,4.4
80,870-72-4431,C,0,1,0,Normal,Female,Health and beauty,99.19,6,29.7570,624.8970,1/21/2019,14:42,Credit card,5.5
64,853-23-2453,B,0,0,1,-,Male,Health and beauty,75.74,4,15.1480,318.1080,2/14/2019,14:35,Cash,7.6

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1006 entries, 0 to 1005
Data columns (total 16 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Invoice ID     1006 non-null   object
 1   Branch         1006 non-null   object
 2   Yangon         1006 non-null   int64
 3   Naypyitaw      1006 non-null   int64
 4   Mandalay       1006 non-null   int64
 5   Customer type  1006 non-null   object
 6   Gender         1006 non-null   object
 7   Product line   1006 non-null   object
 8   Unit price     1006 non-null   object
 9   Quantity       1006 non-null   int64
 10  Tax 5%         997 non-null    float64
 11  Total          1003 non-null   float64
 12  Date           1006 non-null   object
 13  Time           1006 non-null   object
 14  Payment        1006 non-null   object
 15  Rating         1006 non-null   float64
dtypes: float64(3), int64(4), object(9)
memory usage: 125.9+ KB

In [7]:
df.describe()

,Yangon,Naypyitaw,Mandalay,Quantity,Tax 5%,Total,Rating
count,1006.000000,1006.000000,1006.000000,1006.000000,997.000000,1003.000000,1006.000000
mean,0.338966,0.329026,0.332008,5.469185,15.479682,322.734689,7.056163
std,0.473594,0.470093,0.471168,3.014153,11.728320,245.865964,3.318751
min,0.000000,0.000000,0.000000,-8.000000,0.508500,10.678500,4.000000
25%,0.000000,0.000000,0.000000,3.000000,5.986500,123.789750,5.500000
50%,0.000000,0.000000,0.000000,5.000000,12.227500,254.016000,7.000000
75%,1.000000,1.000000,1.000000,8.000000,22.720500,471.009000,8.500000
max,1.000000,1.000000,1.000000,10.000000,49.650000,1042.650000,97.000000

In [8]:
df.duplicated().sum()

6

In [9]:
df.isnull().sum()

Invoice ID       0
Branch           0
Yangon           0
Naypyitaw        0
Mandalay         0
Customer type    0
Gender           0
Product line     0
Unit price       0
Quantity         0
Tax 5%           9
Total            3
Date             0
Time             0
Payment          0
Rating           0
dtype: int64

In [10]:
df['Customer type'].value_counts()

Normal     515
Member     463
-           27
Memberr      1
Name: Customer type, dtype: int64

In [11]:
df['Quantity'].value_counts()

 10    120
 1     111
 4     109
 7     102
 5     102
 6      98
 9      94
 2      92
 3      91
 8      83
-8       2
-1       1
-7       1
Name: Quantity, dtype: int64

In [12]:
negative_values = df[df['Quantity'] < 0]
negative_values

,Invoice ID,Branch,Yangon,Naypyitaw,Mandalay,Customer type,Gender,Product line,Unit price,Quantity,Tax 5%,Total,Date,Time,Payment,Rating
629,308-39-1707,A,1,0,0,Normal,Female,Fashion accessories,12.09 USD,-1,NaN,12.6945,1/26/2019,18:19,Credit card,8.2
830,237-44-6163,A,1,0,0,Normal,Male,Electronic accessories,10.56 USD,-8,NaN,88.7040,1/24/2019,17:43,Cash,7.6
881,115-38-7388,C,0,1,0,Member,Female,Fashion accessories,10.18 USD,-8,NaN,85.5120,3/30/2019,12:51,Credit card,9.5
903,865-41-9075,A,1,0,0,Normal,Male,Food and beverages,11.53 USD,-7,NaN,84.7455,1/28/2019,17:35,Cash,8.1

#### 1- Completeness :
- Remove USD from unit price columns
- Remove (pm)and (-) from Time columns
- Replace the empty values in the "Total" column by multiplying "Quantity" by "Unit Price" and adding "5% Tax"
- Replace empty values in the "5% Tax" column
- Replace (-) with the most common value.

#### 2- Validity :
- Change column names  => 'Invoice_ID' , 'Customer_type' , 'Product_line' , 'Unit_price' , 'Tax_5%' 
- Replace column type Unit price from object to int
- Replace column Date from int to date

#### 3- accuracy :
- nothing outlet in data

#### 4- Consistency :
- remove duplicates

<a id='Cleaning'></a>
## 3- Data Cleaning

In [14]:
#copy from the dataframe
df_clean = df.copy()
df_clean.head()

,Invoice ID,Branch,Yangon,Naypyitaw,Mandalay,Customer type,Gender,Product line,Unit price,Quantity,Tax 5%,Total,Date,Time,Payment,Rating
0,750-67-8428,A,1,0,0,Normal,Male,Health and beauty,74.69,7,26.1415,NaN,1/5/2019,13:08,Ewallet,9.1
1,226-31-3081,C,0,1,0,Normal,Male,Electronic accessories,15.28,5,3.8200,80.2200,3/8/2019,10:29,Cash,9.6
2,631-41-3108,A,1,0,0,Normal,Male,Home and lifestyle,46.33,7,16.2155,340.5255,3/3/2019,13:23,Credit card,7.4
3,123-19-1176,A,1,0,0,Normal,Male,Health and beauty,58.22,8,NaN,489.0480,1/27/2019,8 - 30 PM,Ewallet,8.4
4,373-73-7910,A,1,0,0,Normal,Male,Sports and travel,86.31,7,30.2085,634.3785,2/8/2019,10:37,Ewallet,5.3

### 3-1 Fixing Tidiness issues

#### A- Define :
- 'Yangon', 'Naypyitaw', 'Mandalay' convertir les colonnes

#### B- Code :

In [15]:
# Reshape DataFrame from wide to long format for sales by city  
df_clean = pd.melt(df_clean , 
                    id_vars=['Invoice ID', 'Branch', 'Customer type', 'Gender', 'Product line', 'Unit price', 'Quantity', 'Tax 5%', 'Total', 'Date', 'Time', 'Payment', 'Rating'], 
                    value_vars=['Yangon', 'Naypyitaw', 'Mandalay'], 
                    var_name='City',
                    value_name='Sales')  
#  Filter the "df" to keep only the rows where the "Sales" column is = 1
df_clean = df_clean [df_clean ['Sales'] == 1]

#### C-Test :

In [16]:
df_clean.sample(5)

,Invoice ID,Branch,Customer type,Gender,Product line,Unit price,Quantity,Tax 5%,Total,Date,Time,Payment,Rating,City,Sales
2044,640-49-2076,B,Normal,Male,Sports and travel,83.78,8,33.512,703.752,1/10/2019,14:49,Cash,5.1,Mandalay,1
1368,471-41-2823,C,Normal,Male,Food and beverages,99.79,2,9.979,209.559,3/7/2019,20:37,Ewallet,8.0,Naypyitaw,1
732,756-49-0168,A,Member,Male,Fashion accessories,19.7,1,0.985,20.685,2/8/2019,11:39,Ewallet,9.5,Yangon,1
1563,283-26-5248,C,Member,Female,Food and beverages,98.52,10,49.260,1034.460,1/30/2019,20:23,Ewallet,4.5,Naypyitaw,1
1853,862-29-5914,C,Normal,Female,Sports and travel,22.38,1,1.119,23.499,1/30/2019,17:08,Credit card,8.6,Naypyitaw,1

In [17]:
df_clean['City'].value_counts()

Yangon       341
Mandalay     334
Naypyitaw    331
Name: City, dtype: int64

### 3-2 Fixing Quality Issues

#### A- Define :
- Remove duplicates

#### B- Code :

In [18]:
df_clean = df_clean.drop_duplicates()

#### C-Test  :

In [20]:
df_clean.duplicated().sum()

0

In [21]:
# Remove columns sales
df_clean= df_clean.drop(columns=['Sales'])

#### A- Define :
- Change column names

#### B- Code :

In [22]:
df_clean = df_clean.rename(columns={'Invoice ID': 'Invoice_ID', 'Customer type': 'Customer_type', 'Product line': 'Product_line', 'Unit price': 'Unit_price', 'Tax 5%': 'Tax_5%'})

#### C-Test :

In [23]:
df_clean.head(5)

,Invoice_ID,Branch,Customer_type,Gender,Product_line,Unit_price,Quantity,Tax_5%,Total,Date,Time,Payment,Rating,City
0,750-67-8428,A,Normal,Male,Health and beauty,74.69,7,26.1415,NaN,1/5/2019,13:08,Ewallet,9.1,Yangon
2,631-41-3108,A,Normal,Male,Home and lifestyle,46.33,7,16.2155,340.5255,3/3/2019,13:23,Credit card,7.4,Yangon
3,123-19-1176,A,Normal,Male,Health and beauty,58.22,8,NaN,489.0480,1/27/2019,8 - 30 PM,Ewallet,8.4,Yangon
4,373-73-7910,A,Normal,Male,Sports and travel,86.31,7,30.2085,634.3785,2/8/2019,10:37,Ewallet,5.3,Yangon
6,355-53-5943,A,Normal,Male,Electronic accessories,68.84,6,20.6520,433.6920,2/25/2019,14:36,Ewallet,5.8,Yangon

#### A- Define :
- Remove USD 'from unit' price columns

#### B- Code :

In [24]:
contains_usd = df_clean['Unit_price'].str.contains('USD', regex=False).sum()
contains_usd

5

In [25]:
# df['Unit_price'].contains('USD').sum()

In [26]:
df_clean['Unit_price'] = df_clean['Unit_price'].astype(str).str.replace('USD', '', regex=False).str.strip()

#### C-Test :

In [28]:
df_clean['Unit_price'].value_counts()

83.77    3
99.82    2
39.62    2
95.54    2
42.57    2
        ..
15.37    1
82.63    1
91.4     1
15.43    1
97.38    1
Name: Unit_price, Length: 943, dtype: int64

#### A- Define :
- Replace column type Unit price from object to int

#### B- Code :

In [30]:
df_clean['Unit_price'] = pd.to_numeric(df_clean['Unit_price'])

#### C-Test :

In [31]:
df_clean['Unit_price'].info()

<class 'pandas.core.series.Series'>
Int64Index: 1000 entries, 0 to 3008
Series name: Unit_price
Non-Null Count  Dtype
--------------  -----
1000 non-null   float64
dtypes: float64(1)
memory usage: 15.6 KB

#### A- Define :
- Replace column Date from int to datetime

#### B- Code :

In [32]:
df_clean['Date'] = pd.to_datetime(df_clean['Date'])

#### C-Test :

In [33]:
df_clean['Date'].info()

<class 'pandas.core.series.Series'>
Int64Index: 1000 entries, 0 to 3008
Series name: Date
Non-Null Count  Dtype
--------------  -----
1000 non-null   datetime64[ns]
dtypes: datetime64[ns](1)
memory usage: 15.6 KB

#### A- Define :
- Remove (pm)and (-) from Time columns

#### B- Code :

In [34]:
df_clean['Time'] = df_clean['Time'].replace({' - ': ':'}, regex=True)

In [35]:
df_clean['Time'] = df_clean['Time'].str.replace('PM', '', regex=False).str.replace('AM', '', regex=False).str.strip()

#### C-Test :

In [36]:
df_clean['Time'].value_counts()

19:48    7
14:42    7
17:38    6
10:11    5
17:16    5
        ..
16:51    1
20:15    1
14:11    1
16:05    1
15:17    1
Name: Time, Length: 506, dtype: int64

#### A- Define :
- Replace the empty values in the "Total" column by multiplying "Quantity" by "Unit Price" and adding "5% Tax"

#### B- Code :

In [37]:
df_clean['Total'] = df_clean['Total'].fillna(df_clean['Quantity'] * df_clean['Unit_price'] + df_clean['Tax_5%'])

#### C-Test :

In [39]:
df_clean['Total'].isnull().sum()

0

#### A- Define :
- Replace empty values in the "5% Tax" column

#### B- Code :

In [40]:
df_clean['Tax_5%'] = df_clean['Tax_5%'].fillna(df_clean['Unit_price'] * df_clean['Quantity'] * 0.05)

#### C-Test :

In [41]:
df_clean['Tax_5%'].isnull().sum()

0

#### A- Define :
- Replace (-) with the most common value.

#### B- Code :

In [42]:
most = df_clean['Customer_type'].mode()[0]
most

'Normal'

In [43]:
df_clean['Customer_type'] = df_clean['Customer_type'].replace('-', np.nan)

In [44]:
df_clean['Customer_type'] = df_clean['Customer_type'].fillna(most)

In [45]:
df_clean['Customer_type'] = df_clean['Customer_type'].replace('Memberr', 'Member')

#### C-Test :

In [46]:
df_clean['Customer_type'].value_counts()

Normal    540
Member    460
Name: Customer_type, dtype: int64

#### A- Define :

#### B- Code :

In [47]:
df_clean['Quantity'] = df_clean['Quantity'].abs()

#### C-Test :

In [48]:
df_clean['Quantity'].value_counts()

10    119
1     112
4     109
7     102
5     102
6      98
9      92
2      91
3      90
8      85
Name: Quantity, dtype: int64

In [49]:
# # Profit margin (25%)
profit_margin = 0.25 

# # Calculate Profit margin #    
df_clean['COGS'] = df_clean['Total'] / (1 + profit_margin)

In [50]:
# # Calculate Profit margin 

df_clean['Profit'] = df_clean['Total'] - df_clean['COGS']
df_clean.head(5)

,Invoice_ID,Branch,Customer_type,Gender,Product_line,Unit_price,Quantity,Tax_5%,Total,Date,Time,Payment,Rating,City,COGS,Profit
0,750-67-8428,A,Normal,Male,Health and beauty,74.69,7,26.1415,548.9715,2019-01-05,13:08,Ewallet,9.1,Yangon,439.1772,109.7943
2,631-41-3108,A,Normal,Male,Home and lifestyle,46.33,7,16.2155,340.5255,2019-03-03,13:23,Credit card,7.4,Yangon,272.4204,68.1051
3,123-19-1176,A,Normal,Male,Health and beauty,58.22,8,23.2880,489.0480,2019-01-27,8:30,Ewallet,8.4,Yangon,391.2384,97.8096
4,373-73-7910,A,Normal,Male,Sports and travel,86.31,7,30.2085,634.3785,2019-02-08,10:37,Ewallet,5.3,Yangon,507.5028,126.8757
6,355-53-5943,A,Normal,Male,Electronic accessories,68.84,6,20.6520,433.6920,2019-02-25,14:36,Ewallet,5.8,Yangon,346.9536,86.7384

<a id='Storing'></a>
## 4- Data Storing

In [51]:
df_clean.to_csv('clean_Supermarket_Sales_data.csv')

In [52]:
df_clean.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1000 entries, 0 to 3008
Data columns (total 16 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Invoice_ID     1000 non-null   object
 1   Branch         1000 non-null   object
 2   Customer_type  1000 non-null   object
 3   Gender         1000 non-null   object
 4   Product_line   1000 non-null   object
 5   Unit_price     1000 non-null   float64
 6   Quantity       1000 non-null   int64
 7   Tax_5%         1000 non-null   float64
 8   Total          1000 non-null   float64
 9   Date           1000 non-null   datetime64[ns]
 10  Time           1000 non-null   object
 11  Payment        1000 non-null   object
 12  Rating         1000 non-null   float64
 13  City           1000 non-null   object
 14  COGS           1000 non-null   float64
 15  Profit         1000 non-null   float64
dtypes: datetime64[ns](1), float64(6), int64(1), object(8)
memory usage: 132.8+ KB